# SetInnerRule Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterInverseRule..::..SetInnerRule Method
FilterInverseRule Class See Also
---
Gets the rule being inverted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void SetInnerRule(
	FilterRule innerRule
)
```

Visual Basic
---
```text
Public Sub SetInnerRule ( _
	innerRule As FilterRule _
)
```

Visual C++
---
```text
public:
void SetInnerRule(
	FilterRule^ innerRule
)
```

# ### Parameters
innerRule
    Type: Autodesk.Revit.DB..::..FilterRule The rule to invert.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FilterInverseRule Class
Autodesk.Revit.DB Namespace